testdata/IN_2023_02/eunterschriften/DRV/DRV_MVP_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getOffer xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dol="urn:de:vb:bipro:taa:dol:1.12" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      
      <tarif:Request>
        
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
        
        <tarif:Angebot>
          
          <gevo:Vermittler>
            
            <allg:PartnerID>31976109</allg:PartnerID>
            
            <allg:Vermittlerrolle>
              
              <allg:ArtID>01</allg:ArtID>
              
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
              
            </allg:Vermittlerrolle>
            
          </gevo:Vermittler>
          
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
            
            <partner:PartnerID>31976109</partner:PartnerID>
            
          </tarif:Partner>
          
          <tarif:Partner xsi:type="partner:CT_Person">
            
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
            
            <partner:Anrede>1</partner:Anrede>
            
            <partner:PartnerID>26353040</partner:PartnerID>
            
            <partner:Anschrift>
              
              <allg:Landname>Deutschland</allg:Landname>
              
              <partner:ArtID>1</partner:ArtID>
              
            </partner:Anschrift>
            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
              
              <basis:Erweiterung xsi:type="vb-leben:CT_RisikoErweiterung">
                
                <vb-leben:Raucherstatus>NichtraucherMind10Jahre</vb-leben:Raucherstatus>
                
              </basis:Erweiterung>
              
              <pm-leben:Koerper>
                
                <partner:Groesse>190</partner:Groesse>
                
                <partner:Gewicht>100</partner:Gewicht>
                
              </pm-leben:Koerper>
              
            </partner:ZusaetzlichePartnerdaten>
            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung">
              
              <pm-leben:Fragenkomplex>
                
                <fragen:ArtID xsi:type="dt:STE_FragenkomplexArtBasis">Gesundheit</fragen:ArtID>
                
                <fragen:Bezeichnung>Gesundheitsfragen zur versicherten Person</fragen:Bezeichnung>
                
                <fragen:Element xsi:type="fragen:CT_KomplexeFrage">
                  
                  <fragen:Ordnungsnummer>404</fragen:Ordnungsnummer>
                  
                  <fragen:FachlicheID>A01</fragen:FachlicheID>
                  
                  <fragen:Text>Nennen Sie uns bitte Ihre Körpergröße und Ihr Gewicht (cm/kg).</fragen:Text>
                  
                  <fragen:EinfacheFrage xsi:type="fragen:CT_FrageZahl">
                    
                    <fragen:Ordnungsnummer>405</fragen:Ordnungsnummer>
                    
                    <fragen:FachlicheID>A01_A</fragen:FachlicheID>
                    
                    <fragen:TechnischeID>VP.A01.A01_A</fragen:TechnischeID>
                    
                    <fragen:Text/>
                    
                    <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                    
                    <fragen:AntwortZahl>
                      
                      <fragen:Zahl>190</fragen:Zahl>
                      
                    </fragen:AntwortZahl>
                    
                  </fragen:EinfacheFrage>
                  
                  <fragen:EinfacheFrage xsi:type="fragen:CT_FrageZahl">
                    
                    <fragen:Ordnungsnummer>406</fragen:Ordnungsnummer>
                    
                    <fragen:FachlicheID>A01_B</fragen:FachlicheID>
                    
                    <fragen:TechnischeID>VP.A01.A01_B</fragen:TechnischeID>
                    
                    <fragen:Text/>
                    
                    <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                    
                    <fragen:AntwortZahl>
                      
                      <fragen:Zahl>100.0</fragen:Zahl>
                      
                    </fragen:AntwortZahl>
                    
                  </fragen:EinfacheFrage>
                  
                </fragen:Element>
                
              </pm-leben:Fragenkomplex>
              
            </partner:ZusaetzlichePartnerdaten>
            
            <partner:Bankverbindung>
              
              <partner:Einzugsermaechtigung>true</partner:Einzugsermaechtigung>
              
            </partner:Bankverbindung>
            
            <partner:Geburtsdatum>2003-01-01</partner:Geburtsdatum>
            
            <partner:Geschlecht>1</partner:Geschlecht>
            
            <partner:Berufstaetigkeit>
              
              <basis:Erweiterung xsi:type="vb-leben:CT_BerufstaetigkeitErweiterung">
                
                <vb-leben:DrvBerufsklasse>BK_4</vb-leben:DrvBerufsklasse>
                
              </basis:Erweiterung>
              
              <partner:Beruf>Maler</partner:Beruf>
              
            </partner:Berufstaetigkeit>
            
          </tarif:Partner>
          
          <tarif:Partner xsi:type="partner:CT_Person">
            
            <partner:Anrede>2</partner:Anrede>
            
            <partner:PartnerID>9152493</partner:PartnerID>
            
            <partner:Anschrift>
              
              <allg:Landname>Deutschland</allg:Landname>
              
              <partner:ArtID>1</partner:ArtID>
              
            </partner:Anschrift>
            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
              
              <basis:Erweiterung xsi:type="vb-leben:CT_RisikoErweiterung">
                
                <vb-leben:Raucherstatus>NichtraucherMind10Jahre</vb-leben:Raucherstatus>
                
              </basis:Erweiterung>
              
              <pm-leben:Nichtraucher>true</pm-leben:Nichtraucher>
              
              <pm-leben:Koerper>
                
                <partner:Groesse>190</partner:Groesse>
                
                <partner:Gewicht>100</partner:Gewicht>
                
              </pm-leben:Koerper>
              
            </partner:ZusaetzlichePartnerdaten>
            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung">
              
              <pm-leben:Fragenkomplex>
                
                <fragen:ArtID xsi:type="dt:STE_FragenkomplexArtBasis">Gesundheit</fragen:ArtID>
                
                <fragen:Bezeichnung>Gesundheitsfragen zur mitversicherten Person</fragen:Bezeichnung>
                
                <fragen:Element xsi:type="fragen:CT_KomplexeFrage">
                  
                  <fragen:Ordnungsnummer>404</fragen:Ordnungsnummer>
                  
                  <fragen:FachlicheID>A01</fragen:FachlicheID>
                  
                  <fragen:Text>Nennen Sie uns bitte Ihre Körpergröße und Ihr Gewicht (cm/kg).</fragen:Text>
                  
                  <fragen:EinfacheFrage xsi:type="fragen:CT_FrageZahl">
                    
                    <fragen:Ordnungsnummer>405</fragen:Ordnungsnummer>
                    
                    <fragen:FachlicheID>A01_A</fragen:FachlicheID>
                    
                    <fragen:TechnischeID>MVP.A01.A01_A</fragen:TechnischeID>
                    
                    <fragen:Text/>
                    
                    <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                    
                    <fragen:AntwortZahl>
                      
                      <fragen:Zahl>190</fragen:Zahl>
                      
                    </fragen:AntwortZahl>
                    
                  </fragen:EinfacheFrage>
                  
                  <fragen:EinfacheFrage xsi:type="fragen:CT_FrageZahl">
                    
                    <fragen:Ordnungsnummer>406</fragen:Ordnungsnummer>
                    
                    <fragen:FachlicheID>A01_B</fragen:FachlicheID>
                    
                    <fragen:TechnischeID>MVP.A01.A01_B</fragen:TechnischeID>
                    
                    <fragen:Text/>
                    
                    <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                    
                    <fragen:AntwortZahl>
                      
                      <fragen:Zahl>100.0</fragen:Zahl>
                      
                    </fragen:AntwortZahl>
                    
                  </fragen:EinfacheFrage>
                  
                </fragen:Element>
                
              </pm-leben:Fragenkomplex>
              
            </partner:ZusaetzlichePartnerdaten>
            
            <partner:Geburtsdatum>2003-01-01</partner:Geburtsdatum>
            
            <partner:Geschlecht>2</partner:Geschlecht>
            
            <partner:Berufstaetigkeit>
              
              <basis:Erweiterung xsi:type="vb-leben:CT_BerufstaetigkeitErweiterung">
                
                <vb-leben:DrvBerufsklasse>BK_4</vb-leben:DrvBerufsklasse>
                
              </basis:Erweiterung>
              
              <partner:Beruf>Malerin</partner:Beruf>
              
            </partner:Berufstaetigkeit>
            
          </tarif:Partner>
          
          <tarif:Versicherungsnehmer>
            
            <partner:PartnerID>26353040</partner:PartnerID>
            
          </tarif:Versicherungsnehmer>
          
          <tarif:Verkaufsprodukt>
            
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
              
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
              
            </basis:Erweiterung>
            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
              
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                
              </basis:Erweiterung>
              
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
              
              <pm:Beitrag>
                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                
              </pm:Beitrag>
              
              <pm:Versicherungsdauer>
                
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                
              </pm:Versicherungsdauer>
              
              <pm:Paket xsi:type="dol:STE_PaketErweitert">B</pm:Paket>
              
              <pm:Kennung>DRV</pm:Kennung>
              
              <pm:Elementarprodukt xsi:type="pm-leben:CT_TodesfallAbsicherung">
                
                <basis:Erweiterung xsi:type="vb-leben:CT_TodesfallAbsicherungErweiterung">
                  
                  <vb-leben:ArtRisikoabsicherung>Familie</vb-leben:ArtRisikoabsicherung>
                  
                </basis:Erweiterung>
                
                <pm:Versicherungsdauer>
                  
                  <allg:AnzahlJahre>20</allg:AnzahlJahre>
                  
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                  
                </pm:Versicherungsdauer>
                
                <pm:Dynamik>
                  
                  <pm:Wert>0</pm:Wert>
                  
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                  
                </pm:Dynamik>
                
                <vs-pm:VersicherungssummeOderLeistung>
                  
                  <vs-pm:ArtID xsi:type="vb-leben:STE_VersicherungssummeOderLeistungErweitert">AnfaenglicheTodesfallleistung</vs-pm:ArtID>
                  
                  <vs-pm:Wert>125000</vs-pm:Wert>
                  
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                  
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                  
                  <vs-pm:Auszahlungsweise>6</vs-pm:Auszahlungsweise>
                  
                </vs-pm:VersicherungssummeOderLeistung>
                
                <vs-pm:Bezugsrecht>
                  
                  <vs-pm:Leistungsfall>Erlebensfall</vs-pm:Leistungsfall>
                  
                  <vs-pm:IndexBerechtigter>1</vs-pm:IndexBerechtigter>
                  
                </vs-pm:Bezugsrecht>
                
                <vs-pm:Bezugsrecht>
                  
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                  
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                  
                </vs-pm:Bezugsrecht>
                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">08</pm-leben:UeberschussverwendungVorLeistung>
                
                <pm-leben:Produktattribut>51</pm-leben:Produktattribut>
                
                <pm-leben:MitversichertePerson>
                  
                  <partner:PartnerID>9152493</partner:PartnerID>
                  
                </pm-leben:MitversichertePerson>
                
                <pm-leben:VersichertePerson>
                  
                  <partner:PartnerID>26353040</partner:PartnerID>
                  
                </pm-leben:VersichertePerson>
                
              </pm:Elementarprodukt>
              
              <pm-leben:VorgabeBerechnung>
                
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteTodesfallleistung</pm-leben:ArtID>
                
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">TodesfallAbsicherung</pm-leben:Kontext>
                
              </pm-leben:VorgabeBerechnung>
              
            </pm:Produkt>
            
          </tarif:Verkaufsprodukt>
          
          <tarif:Beitragszahler>
            
            <partner:PartnerID>26353040</partner:PartnerID>
            
          </tarif:Beitragszahler>
          
        </tarif:Angebot>
        
      </tarif:Request>
      
    </tarif:getOffer>
  </soapenv:Body>
</soapenv:Envelope>
